{'messages': [
    HumanMessage(content='Để tính cosine similarity giữa hai đoạn prompt (teacher vs student), ta cần tìm các đặc điểm phong cách chính (style features) của từng đoạn. 2 Câu prompt như sau:  teacher prompt: In the heart of a lush, vibrant jungle, a magnificent orange tiger with black stripes prowls silently through the emerald foliage. Its piercing yellow eyes gleam with curiosity and strength as it gracefully leaps over vibrant flowers, ready to embark on an adventurous quest filled with surprises and wonder. Student prompt: Deep within a dense, enchanting rainforest, a majestic golden lion with a flowing mane moves stealthily through the verdant undergrowth. Its sharp amber eyes shimmer with wisdom and power as it elegantly strides past blooming orchids, prepared to embark on a thrilling journey brimming with mystery and excitement.', additional_kwargs={}, response_metadata={}, id='0fb73b38-fd88-4290-a870-4067ad32d7df'), 
    AIMessage(content='', additional_kwargs={'function_call': {'name': 'make_style_prompt', 'arguments': '{
                    "style": "Deep within a dense, enchanting rainforest, a majestic golden lion with a flowing mane moves stealthily through the verdant undergrowth. Its sharp amber eyes shimmer with wisdom and power as it elegantly strides past blooming orchids, prepared to embark on a thrilling journey brimming with mystery and excitement."
                }'
            }
        }, response_metadata={'prompt_feedback': {'block_reason': 0, 'safety_ratings': []
            }, 'finish_reason': 'STOP', 'safety_ratings': []
        }, id='run-a8f07dba-5d3e-40f0-b2d3-84448076c9bc-0', tool_calls=[
            {'name': 'make_style_prompt', 'args': {'style': 'In the heart of a lush, vibrant jungle, a magnificent orange tiger with black stripes prowls silently through the emerald foliage. Its piercing yellow eyes gleam with curiosity and strength as it gracefully leaps over vibrant flowers, ready to embark on an adventurous quest filled with surprises and wonder.'
                }, 'id': '6f5c4567-0836-4d55-9068-11bbddec2e29', 'type': 'tool_call'
            },
            {'name': 'make_style_prompt', 'args': {'style': 'Deep within a dense, enchanting rainforest, a majestic golden lion with a flowing mane moves stealthily through the verdant undergrowth. Its sharp amber eyes shimmer with wisdom and power as it elegantly strides past blooming orchids, prepared to embark on a thrilling journey brimming with mystery and excitement.'
                }, 'id': '16c7823f-6eb2-4568-aa89-413a5802d619', 'type': 'tool_call'
            }
        ], usage_metadata={'input_tokens': 349, 'output_tokens': 123, 'total_tokens': 472, 'input_token_details': {'cache_read': 0
            }
        }), ToolMessage(content='In the heart of a lush, vibrant jungle, a magnificent orange tiger with black stripes prowls silently through the emerald foliage. Its piercing yellow eyes gleam with curiosity and strength as it gracefully leaps over vibrant flowers, ready to embark on an adventurous quest filled with surprises and wonder.', name='make_style_prompt', id='227051dc-1e14-4a48-ae8c-aab67603225c', tool_call_id='6f5c4567-0836-4d55-9068-11bbddec2e29'), ToolMessage(content='Deep within a dense, enchanting rainforest, a majestic golden lion with a flowing mane moves stealthily through the verdant undergrowth. Its sharp amber eyes shimmer with wisdom and power as it elegantly strides past blooming orchids, prepared to embark on a thrilling journey brimming with mystery and excitement.', name='make_style_prompt', id='6bf11f5e-ad58-4ed5-a92e-60f584673bff', tool_call_id='16c7823f-6eb2-4568-aa89-413a5802d619'), 
        HumanMessage(content='**Style of Prompt 1:**\n\nThe style is descriptive and imaginative, employing vivid imagery and rich vocabulary to paint a picture of a tiger in a jungle. The tone is adventurous and wondrous, with a focus on the tiger\'s grace, curiosity, and the promise of an exciting quest. Sentence structure is complex, using participial phrases and multiple adjectives to enhance the detailed descriptions. Words like "magnificent,""vibrant,""emerald," and "gleam" contribute to the overall sense of awe and beauty.\n\n**Style of Prompt 2:**\n\nThis prompt also exhibits a descriptive and imaginative style, similar to the first prompt. It uses strong imagery and evocative language to depict a lion in a rainforest. The tone is thrilling and mysterious, emphasizing the lion\'s majesty, wisdom, and the anticipation of an exciting journey. The sentence structure is complex, mirroring the first prompt\'s use of descriptive phrases and varied vocabulary. Words like "majestic,""enchanting,""verdant," and "shimmer" create a sense of wonder and excitement.\n\n**Comparison:**\n\nBoth prompts share a highly descriptive and imaginative style, using vivid imagery and rich vocabulary to create a sense of adventure and wonder. They both employ complex sentence structures with multiple adjectives and descriptive phrases. The tone is similar, focusing on the majesty of the animal and the excitement of the journey. The main differences lie in the specific details and word choices used to describe the setting and the animal, reflecting the shift from a tiger in a jungle to a lion in a rainforest. Both prompts aim to evoke a sense of awe and anticipation in the reader.\nFINAL ANSWER', additional_kwargs={}, response_metadata={}, name='get_style_with_llm', id='3ab45e35-5bcf-48ba-85e9-b08f114b3352')
    ]
}